Cata1022/Autonomous-Vehicle-NXP-IPCEI-GenAI-Embedded-Summer-School/src_mcxa153/frdmmcxa153/board/pin_mux.c
    PORT3->PCR[10] = ((PORT3->PCR[10] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_11 (pin 39) is configured as PWM0_B2 */
    PORT_SetPinMux(BOARD_INITPINS_MOTOR_RIGHT_2_PORT, BOARD_INITPINS_MOTOR_RIGHT_2_PIN, kPORT_MuxAlt5);

    PORT3->PCR[11] = ((PORT3->PCR[11] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_12 (pin 38) is configured as PWM0_X0 */
    PORT_SetPinMux(BOARD_INITPINS_LED_RED_PORT, BOARD_INITPINS_LED_RED_PIN, kPORT_MuxAlt5);

    PORT3->PCR[12] = ((PORT3->PCR[12] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_13 (pin 37) is configured as PWM0_X1 */
    PORT_SetPinMux(BOARD_INITPINS_LED_BACK_RIGHT_GREEN_PORT, BOARD_INITPINS_LED_BACK_RIGHT_GREEN_PIN, kPORT_MuxAlt5);

    PORT3->PCR[13] = ((PORT3->PCR[13] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_14 (pin 36) is configured as PWM0_X2 */
    PORT_SetPinMux(BOARD_INITPINS_LED_FRONT_RIGHT_GREEN_PORT, BOARD_INITPINS_LED_FRONT_RIGHT_GREEN_PIN, kPORT_MuxAlt5);

    PORT3->PCR[14] = ((PORT3->PCR[14] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    PORT3->PCR[7] = ((PORT3->PCR[7] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_MUX_MASK | PORT_PCR_IBE_MASK)))

                     /* Pin Multiplex Control: PORT3_7 (pin 43) is configured as PWM0_B0. */
                     | PORT_PCR_MUX(PORT3_PCR7_MUX_mux101)

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_8 (pin 42) is configured as PWM0_A1 */
    PORT_SetPinMux(BOARD_INITPINS_MOTOR_LEFT_1_PORT, BOARD_INITPINS_MOTOR_LEFT_1_PIN, kPORT_MuxAlt5);

    PORT3->PCR[8] = ((PORT3->PCR[8] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_9 (pin 41) is configured as PWM0_B1 */
    PORT_SetPinMux(BOARD_INITPINS_MOTOR_LEFT_2_PORT, BOARD_INITPINS_MOTOR_LEFT_2_PIN, kPORT_MuxAlt5);

    PORT3->PCR[9] = ((PORT3->PCR[9] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    gpio_pin_config_t LED_FRONT_LEFT_RED_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_6 (pin 64)  */
    GPIO_PinInit(BOARD_INITPINS_LED_FRONT_LEFT_RED_GPIO, BOARD_INITPINS_LED_FRONT_LEFT_RED_PIN, &LED_FRONT_LEFT_RED_config);

    gpio_pin_config_t LED_FRONT_LEFT_BLUE_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_7 (pin 1)  */
    GPIO_PinInit(BOARD_INITPINS_LED_FRONT_LEFT_BLUE_GPIO, BOARD_INITPINS_LED_FRONT_LEFT_BLUE_PIN, &LED_FRONT_LEFT_BLUE_config);

    gpio_pin_config_t LED_BACK_LEFT_RED_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_4 (pin 18)  */
    GPIO_PinInit(BOARD_INITPINS_LED_BACK_LEFT_RED_GPIO, BOARD_INITPINS_LED_BACK_LEFT_RED_PIN, &LED_BACK_LEFT_RED_config);

    gpio_pin_config_t LED_BACK_RIGHT_RED_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_5 (pin 19)  */
    GPIO_PinInit(BOARD_INITPINS_LED_BACK_RIGHT_RED_GPIO, BOARD_INITPINS_LED_BACK_RIGHT_RED_PIN, &LED_BACK_RIGHT_RED_config);

    gpio_pin_config_t LED_FRONT_RIGHT_RED_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_12 (pin 22)  */
    GPIO_PinInit(BOARD_INITPINS_LED_FRONT_RIGHT_RED_GPIO, BOARD_INITPINS_LED_FRONT_RIGHT_RED_PIN, &LED_FRONT_RIGHT_RED_config);

    gpio_pin_config_t LED_FRONT_RIGHT_BLUE_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_16 (pin 24)  */
    GPIO_PinInit(BOARD_INITPINS_LED_FRONT_RIGHT_BLUE_GPIO, BOARD_INITPINS_LED_FRONT_RIGHT_BLUE_PIN, &LED_FRONT_RIGHT_BLUE_config);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
